---
kind: enumMember
id: F:Autodesk.Revit.DB.EntryAndSchemeConsistency.InconsistentStorageType
enum: Autodesk.Revit.DB.EntryAndSchemeConsistency
source: html/be67c45f-7c5d-51f6-686d-d33993737f16.htm
---
# Autodesk.Revit.DB.EntryAndSchemeConsistency.InconsistentStorageType

The type of value stored in the entry is different from the type of the scheme parameter.